In [2]:
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
import src.read_data

In [3]:
df = src.read_data.get_df()
df.head()

    Atm ProcessDate  Withdrawal
0  ATM1  2017-01-02       31950
1  ATM1  2017-01-03       18800
2  ATM1  2017-01-04       16180
3  ATM1  2017-01-05       39100
4  ATM1  2017-01-07       19450

In [19]:
df['Withdrawal'].isna().sum()

0

In [14]:
print(df['Withdrawal'].describe().to_markdown())

|       |   Withdrawal |
|:------|-------------:|
| count |       8942   |
| mean  |      25271.2 |
| std   |      19715.9 |
| min   |         20   |
| 25%   |       9960   |
| 50%   |      21325   |
| 75%   |      36935   |
| max   |     191210   |

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8942 entries, 0 to 8941
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Atm          8942 non-null   object
 1   ProcessDate  8942 non-null   datetime64[ns]
 2   Withdrawal   8942 non-null   int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 209.7+ KB

In [6]:
ts = df.set_index('ProcessDate')
ts.head()

              Atm  Withdrawal
ProcessDate
2017-01-02   ATM1       31950
2017-01-03   ATM1       18800
2017-01-04   ATM1       16180
2017-01-05   ATM1       39100
2017-01-07   ATM1       19450

In [9]:
ts['2017-01':'2017-04']

              Atm  Withdrawal
ProcessDate
2017-01-02   ATM1       31950
2017-01-03   ATM1       18800
2017-01-04   ATM1       16180
2017-01-05   ATM1       39100
2017-01-07   ATM1       19450
...           ...         ...
2017-04-26   ATM9       14940
2017-04-27   ATM9       21960
2017-04-28   ATM9       41190
2017-04-29   ATM9       34830
2017-04-30   ATM9       10690

[1049 rows x 2 columns]

In [24]:
ndf = df.groupby('Atm').agg(['min', 'max', 'count'])
del ndf[('ProcessDate', 'count')]
print(ndf.to_markdown())

| Atm   | ('ProcessDate', 'min')   | ('ProcessDate', 'max')   |   ('Withdrawal', 'min') |   ('Withdrawal', 'max') |   ('Withdrawal', 'count') |
|:------|:-------------------------|:-------------------------|------------------------:|------------------------:|--------------------------:|
| ATM1  | 2017-01-02 00:00:00      | 2019-10-31 00:00:00      |                      20 |                   93060 |                       883 |
| ATM2  | 2017-01-01 00:00:00      | 2019-10-31 00:00:00      |                     570 |                   97120 |                      1034 |
| ATM3  | 2017-01-01 00:00:00      | 2019-10-31 00:00:00      |                      50 |                   72940 |                      1029 |
| ATM4  | 2017-01-01 00:00:00      | 2019-10-31 00:00:00      |                     200 |                   85530 |                      1028 |
| ATM5  | 2017-01-01 00:00:00      | 2019-10-31 00:00:00      |                      80 |                   73080 |                      1030 |
| ATM6  | 2017-01-01 00:00:00      | 2019-10-31 00:00:00      |                     300 |                   84450 |                      1031 |
| ATM7  | 2017-01-02 00:00:00      | 2019-10-31 00:00:00      |                     150 |                   50790 |                       941 |
| ATM8  | 2017-01-01 00:00:00      | 2019-10-31 00:00:00      |                      20 |                  191210 |                      1018 |
| ATM9  | 2017-01-02 00:00:00      | 2019-10-31 00:00:00      |                    2590 |                   83700 |                       948 |